# BuiltInFailures.DesignOptionFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures Class
BuiltInFailures Class Members See Also
---
Failures about DesignOptionFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DesignOptionFailures
```

Visual Basic
---
```text
Public NotInheritable Class DesignOptionFailures
```

Visual C++
---
```text
public ref class DesignOptionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DesignOptionFailures
# See Also
BuiltInFailures..::..DesignOptionFailures Members
Autodesk.Revit.DB Namespace